<?php
var_dump(getimagesize("http://www.dongphucbaotram.com:7787/mediaroot/media/userfiles/useruploads/93/image/m03(9).jpg"));

$re = array('ấ','ầ','ẩ','ẫ','ậ','Ấ','Ầ','Ẩ','Ẫ','Ậ','ắ','ằ','ẳ','ẵ','ặ','Ắ','Ằ','Ẳ','Ẵ','Ặ','á','à','ả','ã','ạ','â','ă','Á','À','Ả','Ã','Ạ','Â','Ă'
            ,'ế','ề','ể','ễ','ệ','Ế','Ề','Ể','Ễ','Ệ','é','è','ẻ','ẽ','ẹ','ê','É','È','Ẻ','Ẽ','Ẹ','Ê'
            ,'í','ì','ỉ','ĩ','ị','Í','Ì','Ỉ','Ĩ','Ị'
            ,'ố','ồ','ổ','ỗ','ộ','Ố','Ồ','Ổ','Ô','Ộ','ớ','ờ','ở','ỡ','ợ','Ớ','Ờ','Ở','Ỡ','Ợ','ó','ò','ỏ','õ','ọ','ô','ơ','Ó','Ò','Ỏ','Õ','Ọ','Ô','Ơ'
            ,'ứ','ừ','ử','ữ','ự','Ứ','Ừ','Ử','Ữ','Ự','ú','ù','ủ','ũ','ụ','ư','Ú','Ù','Ủ','Ũ','Ụ','Ư'
            ,'ý','ỳ','ỷ','ỹ','ỵ','Ý','Ỳ','Ỷ','Ỹ','Ỵ'
            ,'đ','Đ');

echo preg_match('/['.implode("",$re).']/',"http://www.dongphucbaotram.com:7787/mediaroot/media/userfiles/useruploads/93/image/Nữ-M02(2).jpg");
?>